posts/linux-matrix.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-30 Tue 14:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linux : The Matrix</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="preamble" class="status">
<link rel="stylesheet" type="text/css" href="/stylesheet.css"/>

<p align="right">
<a class="active" href="/"></a> |
<a href="/posts/">Posts</a> |
<a href="/snippets/">Snippets</a> |
<a href="/repository.html">Repository</a> |
<a href="/about.html">About</a> |
<a href="/rss.xml"> rss </a>
</p>
</div>
<div id="content">
<header>
<h1 class="title">Linux : The Matrix</h1>
</header>
<div id="outline-container-org1ae94d9" class="outline-2">
<h2 id="org1ae94d9">Terminals to Rescue&#xa0;&#xa0;&#xa0;<span class="tag"><span class="terminal">terminal</span>&#xa0;<span class="cheatsheet">cheatsheet</span>&#xa0;<span class="minimal">minimal</span></span></h2>
<div class="outline-text-2" id="text-org1ae94d9">
<p>
There are tons of linux command line cheatsheet or guides.
</p>

<p>
Here are some of the best reads, I suggest you to go throught each of it, <b>It&rsquo;s a gem</b>.
</p>


<ul class="org-ul">
<li><a href="https://github.com/jlevy/the-art-of-command-line">The Art of Command Line</a> — notes and tips on using the command-line, suitable for both beginners and experienced users.</li>
<li><a href="https://www.commandlinefu.com/commands/browse/sort-by-votes">commandlinefu</a> — command-line gems, includes a handy search feature.</li>
<li><a href="https://github.com/tldr-pages/tldr">tldr</a> — collection of community-maintained help pages for command-line tools.</li>
<li><a href="https://explainshell.com/">explainshell</a> — write down a command-line to see the help text that matches each argument.</li>
<li><a href="http://www.compciv.org/unix-tools/">General purpose command-line tools</a> — examples for most common usecases.</li>
<li><a href="https://devmanual.gentoo.org/tools-reference/bash/index.html">Bash reference cheatsheet</a> — nicely formatted and explained well.</li>
<li><a href="https://devhints.io/bash">Bash scripting cheatsheet</a> — quick reference to getting started with Bash scripting.</li>
</ul>

<hr>

<div class="org-center">
<p>
<b>With that <code>coded</code>, I hope you enjoy the terminal. Unleash the Matrix</b>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br><br>
<!-- <p class="date" id="content" align="left" style="font-size:0.8em;">Posted on: 2023-04-12 Wed 00:00 -->
<!--   <br> -->
<!--  Updated on: 2024-01-30 Tue 14:53 -->
<!-- </p> -->

<p align="center" style="font-size:0.7em;">
<br>
- - - - - - -  - - - - - - -  - - - - - - -  - - - - - - -
<br><br>
 2023 - 2024 <b>Dilip</b>  Made with 󰣐  using <a href="https://orgmode.org/">Org-mode</a> &amp; <a href="https://www.gnu.org/software/emacs/">Emacs</a>
<br>
The <a href="https://github.com/idlip/idlip.github.io">code</a> for this site is licensed under the <a href="https://www.gnu.org/licenses/gpl-3.0.en.html">GPLv3</a>, and the content is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC-BY-SA 4.0</a>
</p>

<!-- with org convert -->

<!-- #+attr_html: :align center :style font-size:0.7em; -->
<!-- Made with 󰣐  using [[https://orgmode.org][Org-mode]] & [[https://www.gnu.org/software/emacs/][Emacs]] -->
<!-- The [[https://github.com/idlip/idlip.github.io][code]] for this site is licensed under the [[https://www.gnu.org/licenses/gpl-3.0.en.html][GPLv3]], and the content is licensed under [[https://creativecommons.org/licenses/by-sa/4.0/][CC-BY-SA 4.0]] -->
</div>
</body>
</html>
